micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_ll_rcc.c
/**
  ******************************************************************************
  * @file    stm32n6xx_ll_rcc.c
  * @author  MCD Application Team
  * @brief   RCC LL module driver.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_ll_rcc.h"
#include "stm32n6xx_ll_bus.h"
#ifdef  USE_FULL_ASSERT
#include "stm32_assert.h"
#else
#define assert_param(expr) ((void)0U)
#endif /* USE_FULL_ASSERT */

/** @addtogroup STM32N6xx_LL_Driver
  * @{
  */

#if defined(RCC)

/** @addtogroup RCC_LL
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @addtogroup RCC_LL_Private_Macros
  * @{
  */
#define IS_LL_RCC_ADC_CLKSOURCE(__VALUE__)    ((__VALUE__) == LL_RCC_ADC_CLKSOURCE)

#define IS_LL_RCC_ADF_CLKSOURCE(__VALUE__)    ((__VALUE__) == LL_RCC_ADF1_CLKSOURCE)

#define IS_LL_RCC_DCMIPP_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_DCMIPP_CLKSOURCE)

#define IS_LL_RCC_ETH_CLKSOURCE(__VALUE__)    ((__VALUE__) == LL_RCC_ETH1_CLKSOURCE)

#define IS_LL_RCC_ETHPTP_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_ETH1PTP_CLKSOURCE)

#define IS_LL_RCC_FDCAN_CLKSOURCE(__VALUE__)  ((__VALUE__) == LL_RCC_FDCAN_CLKSOURCE)

#define IS_LL_RCC_FMC_CLKSOURCE(__VALUE__)    ((__VALUE__) == LL_RCC_FMC_CLKSOURCE)

#define IS_LL_RCC_I2C_CLKSOURCE(__VALUE__)    (((__VALUE__) == LL_RCC_I2C1_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_I2C2_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_I2C3_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_I2C4_CLKSOURCE))

#define IS_LL_RCC_I3C_CLKSOURCE(__VALUE__)    (((__VALUE__) == LL_RCC_I3C1_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_I3C2_CLKSOURCE))

#define IS_LL_RCC_LPTIM_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_LPTIM1_CLKSOURCE)  \
                                               || ((__VALUE__) == LL_RCC_LPTIM2_CLKSOURCE)  \
                                               || ((__VALUE__) == LL_RCC_LPTIM3_CLKSOURCE)  \
                                               || ((__VALUE__) == LL_RCC_LPTIM4_CLKSOURCE)  \
                                               || ((__VALUE__) == LL_RCC_LPTIM5_CLKSOURCE))

#define IS_LL_RCC_LTDC_CLKSOURCE(__VALUE__)   ((__VALUE__) == LL_RCC_LTDC_CLKSOURCE)

#define IS_LL_RCC_MDF_CLKSOURCE(__VALUE__)    ((__VALUE__) == LL_RCC_MDF1_CLKSOURCE)

#define IS_LL_RCC_OTGPHY_CLKSOURCE(__VALUE__) (((__VALUE__) == LL_RCC_OTGPHY1_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_OTGPHY2_CLKSOURCE))

#define IS_LL_RCC_OTGPHYCKREF_CLKSOURCE(__VALUE__) (((__VALUE__) == LL_RCC_OTGPHY1CKREF_CLKSOURCE) \
                                                    || ((__VALUE__) == LL_RCC_OTGPHY2CKREF_CLKSOURCE))

#define IS_LL_RCC_PSSI_CLKSOURCE(__VALUE__)   ((__VALUE__) == LL_RCC_PSSI_CLKSOURCE)

#define IS_LL_RCC_SAI_CLKSOURCE(__VALUE__)    (((__VALUE__) == LL_RCC_SAI1_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_SAI2_CLKSOURCE))

#define IS_LL_RCC_SDMMC_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_SDMMC1_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_SDMMC2_CLKSOURCE))

#define IS_LL_RCC_SPDIFRX_CLKSOURCE(__VALUE__) ((__VALUE__) == LL_RCC_SPDIFRX1_CLKSOURCE)

#define IS_LL_RCC_SPI_CLKSOURCE(__VALUE__)    (((__VALUE__) == LL_RCC_SPI1_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_SPI2_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_SPI3_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_SPI4_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_SPI5_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_SPI6_CLKSOURCE))

#define IS_LL_RCC_UART_CLKSOURCE(__VALUE__)   (((__VALUE__) == LL_RCC_UART4_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_UART5_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_UART7_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_UART8_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_UART9_CLKSOURCE))

#define IS_LL_RCC_USART_CLKSOURCE(__VALUE__)  (((__VALUE__) == LL_RCC_USART1_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_USART2_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_USART3_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_USART6_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_USART10_CLKSOURCE))

#define IS_LL_RCC_XSPI_CLKSOURCE(__VALUE__)   (((__VALUE__) == LL_RCC_XSPI1_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_XSPI2_CLKSOURCE) \
                                               || ((__VALUE__) == LL_RCC_XSPI3_CLKSOURCE))

/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup RCC_LL_Private_Functions RCC Private functions
  * @{
  */
static uint32_t RCC_GetHCLKClockFreq(uint32_t SYSCLK_Frequency);
static uint32_t RCC_GetPCLK1ClockFreq(uint32_t HCLK_Frequency);
static uint32_t RCC_GetPCLK2ClockFreq(uint32_t HCLK_Frequency);
static uint32_t RCC_GetPCLK4ClockFreq(uint32_t HCLK_Frequency);
static uint32_t RCC_GetPCLK5ClockFreq(uint32_t HCLK_Frequency);

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @addtogroup RCC_LL_Exported_Functions
  * @{
  */

/** @addtogroup RCC_LL_EF_Init
  * @{
  */

/**
  * @brief  Resets the RCC clock configuration to the default reset state.
  * @note   The default reset state of the clock configuration is given below:
  *            - HSI ON and used as system clock source
  *            - HSE, PLL1, PLL2 and PLL3 OFF
  *            - AHB, APB Bus pre-scaler set to 1.
  *            - CSS, MCO1 and MCO2 OFF
  *            - All interrupts disabled
  * @note   This function doesn't modify the configuration of the
  *            - Peripheral clocks
  *            - LSI, LSE and RTC clocks
  * @retval None
  */
void LL_RCC_DeInit(void)
{
  /* Disable all interrupts except default one */
  WRITE_REG(RCC->CIER, RCC_CIER_HSECSSIE);

  /* Clear all interrupts flags */
  WRITE_REG(RCC->CICR, RCC_CICR_LSIRDYC | RCC_CICR_LSERDYC | RCC_CICR_MSIRDYC | RCC_CICR_HSIRDYC | RCC_CICR_HSERDYC | \
            RCC_CICR_PLL1RDYC | RCC_CICR_PLL2RDYC | RCC_CICR_PLL3RDYC | RCC_CICR_PLL4RDYC | \
            RCC_CICR_LSECSSC | RCC_CICR_HSECSSC | RCC_CICR_WKUPFC);

  /* Clear reset source flags */
  SET_BIT(RCC->RSR, RCC_RSR_RMVF);

  /* Restore default HSI */
  LL_RCC_HSI_SetDivider(LL_RCC_HSI_DIV_1);
  LL_RCC_HSI_Enable();

  /* Wait for HSI READY bit */
  while (LL_RCC_HSI_IsReady() == 0U)
  {}

