micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_ll_rcc.c
  /* Reset CFGR1 register to select HSI as system clock */
  CLEAR_REG(RCC->CFGR1);

  /* Reset MSION, HSEON, PLL1ON, PLL2ON, PLL3ON and PLL4ON bits */
  WRITE_REG(RCC->CCR, RCC_CCR_MSIONC | RCC_CCR_HSEONC | \
            RCC_CCR_PLL1ONC | RCC_CCR_PLL2ONC | RCC_CCR_PLL3ONC | RCC_CCR_PLL4ONC);

  /* Wait for PLL1 READY bit to be reset */
  while (LL_RCC_PLL1_IsReady() != 0U)
  {}

  /* Wait for PLL2 READY bit to be reset */
  while (LL_RCC_PLL2_IsReady() != 0U)
  {}

  /* Wait for PLL3 READY bit to be reset */
  while (LL_RCC_PLL3_IsReady() != 0U)
  {}

  /* Wait for PLL4 READY bit to be reset */
  while (LL_RCC_PLL4_IsReady() != 0U)
  {}

  /* Reset prescalers in CFGR2 register */
  CLEAR_REG(RCC->CFGR2);

  /* Reset LSECFGR register */
  CLEAR_REG(RCC->LSECFGR);

  /* Reset MSICFGR register */
  CLEAR_REG(RCC->MSICFGR);

  /* Reset HSIMCR register to default value */
  WRITE_REG(RCC->HSIMCR, 0x001F07A1U);

  /* Reset HSECFGR register to default value */
  WRITE_REG(RCC->HSECFGR, 0x00000800U);

  /* Reset STOPCR register to default value */
  WRITE_REG(RCC->STOPCR, 0x00000008U);

  /* Reset PLL1 registers to default value */
  WRITE_REG(RCC->PLL1CFGR1, 0x08202500U);
  WRITE_REG(RCC->PLL1CFGR2, 0x00800000U);
  WRITE_REG(RCC->PLL1CFGR3, 0x4900000DU);
  /* Reset PLL2 registers to default value */
  WRITE_REG(RCC->PLL2CFGR1, 0x08000000U);
  WRITE_REG(RCC->PLL2CFGR2, 0x00000000U);
  WRITE_REG(RCC->PLL2CFGR3, 0x49000005U);
  /* Reset PLL3 registers to default value */
  WRITE_REG(RCC->PLL3CFGR1, 0x08000000U);
  WRITE_REG(RCC->PLL3CFGR2, 0x00000000U);
  WRITE_REG(RCC->PLL3CFGR3, 0x49000005U);
  /* Reset PLL4 registers to default value */
  WRITE_REG(RCC->PLL4CFGR1, 0x08000000U);
  WRITE_REG(RCC->PLL4CFGR2, 0x00000000U);
  WRITE_REG(RCC->PLL4CFGR3, 0x49000005U);

  /* Disable DIVENR register to set ICx state to default value */
  WRITE_REG(RCC->DIVENCR, 0x00FFFFFFU);

  /* ICxCFGR reset value */
  WRITE_REG(RCC->IC1CFGR, 0x00020000U);
  WRITE_REG(RCC->IC2CFGR, 0x00030000U);
  WRITE_REG(RCC->IC3CFGR, 0x00000000U);
  WRITE_REG(RCC->IC4CFGR, 0x00000000U);
  WRITE_REG(RCC->IC5CFGR, 0x00000000U);
  WRITE_REG(RCC->IC6CFGR, 0x00030000U);
  WRITE_REG(RCC->IC7CFGR, 0x10000000U);
  WRITE_REG(RCC->IC8CFGR, 0x10000000U);
  WRITE_REG(RCC->IC9CFGR, 0x10000000U);
  WRITE_REG(RCC->IC10CFGR, 0x10000000U);
  WRITE_REG(RCC->IC11CFGR, 0x00030000U);
  WRITE_REG(RCC->IC12CFGR, 0x20000000U);
  WRITE_REG(RCC->IC13CFGR, 0x20000000U);
  WRITE_REG(RCC->IC14CFGR, 0x20000000U);
  WRITE_REG(RCC->IC15CFGR, 0x20000000U);
  WRITE_REG(RCC->IC16CFGR, 0x30000000U);
  WRITE_REG(RCC->IC17CFGR, 0x30000000U);
  WRITE_REG(RCC->IC18CFGR, 0x30000000U);
  WRITE_REG(RCC->IC19CFGR, 0x30000000U);
  WRITE_REG(RCC->IC20CFGR, 0x30000000U);

  /* CCIPRx reset value except RTCSEL/RTCPRE preserved */
  WRITE_REG(RCC->CCIPR1, 0x00000000U);
  WRITE_REG(RCC->CCIPR2, 0x00000000U);
  WRITE_REG(RCC->CCIPR3, 0x00000001U);
  WRITE_REG(RCC->CCIPR4, 0x00000000U);
  WRITE_REG(RCC->CCIPR5, 0x0000F0F0U);
  WRITE_REG(RCC->CCIPR6, 0x00000000U);
  MODIFY_REG(RCC->CCIPR7, RCC_CCIPR7_PERSEL | RCC_CCIPR7_PSSISEL | \
             RCC_CCIPR7_SAI1SEL | RCC_CCIPR7_SAI2SEL, 0x00000000U);
  WRITE_REG(RCC->CCIPR8, 0x00000000U);
  WRITE_REG(RCC->CCIPR9, 0x00000000U);
  WRITE_REG(RCC->CCIPR12, 0x00000000U);
  WRITE_REG(RCC->CCIPR13, 0x00000000U);
  WRITE_REG(RCC->CCIPR14, 0x00000000U);

  /* Reset MEMENR register to default value */
  WRITE_REG(RCC->MEMENR, 0x000013FFU);

  /* Reset MISCENR register */
  CLEAR_REG(RCC->MISCENR);
}

/**
  * @}
  */

/** @addtogroup RCC_LL_EF_Get_Freq
  * @brief  Return the frequencies of different on chip clocks;  System, AHB, APB1, APB2, APB3 and APB4 buses clocks.
  *         and different peripheral clocks available on the device.
  * @note   If SYSCLK source is HSI, function returns values based on HSI_VALUE(*)
  * @note   If SYSCLK source is HSE, function returns values based on HSE_VALUE(**)
  * @note   If SYSCLK source is MSI, function returns values based on MSI_VALUE(***)
  * @note   If SYSCLK source is PLL, function returns values based on HSE_VALUE(**)
  *         or HSI_VALUE(*) multiplied/divided by the PLL factors.
  * @note   (*) HSI_VALUE is a constant defined in header file (default value
  *             64 MHz) divider by HSIDIV, but the real value may vary depending on
  *             on the variations in voltage and temperature.
  * @note   (**) HSE_VALUE is a constant defined in header file (default value
  *              25 MHz), user has to ensure that HSE_VALUE is same as the real
  *              frequency of the crystal used. Otherwise, this function may
  *              have wrong result.
  * @note   (***) MSI_VALUE is a constant defined in header file (default value
  *               4 MHz) but the real value may vary depending on the variations
  *               in voltage and temperature.
  * @note   The result of this function could be incorrect when using fractional
  *         value for HSE crystal.
  * @note   This function can be used by the user application to compute the
  *         baud-rate for the communication peripherals or configure other parameters.
  * @{
  */

/**
  * @brief  Return the frequencies of different on chip clocks;  CPU, System bus, AHB, APB1, APB2, APB4
  *         and APB5 buses clocks.
  * @note   Each time CPUCLK, SYSCLK, HCLK, PCLK1, PCLK2, PCLK4 and/or PCLK5 clock changes, this function
  *         must be called to update application structure fields. Otherwise, any configuration based on this
  *         function will be incorrect.
  * @param  RCC_Clocks pointer to a @ref LL_RCC_ClocksTypeDef structure which will hold the clocks frequencies
  * @retval None
  */
void LL_RCC_GetSystemClocksFreq(LL_RCC_ClocksTypeDef *RCC_Clocks)
{
  /* Get CPU frequency */
  RCC_Clocks->CPUCLK_Frequency = LL_RCC_GetCpuClockFreq();

  /* Get SYSCLK frequency */
  RCC_Clocks->SYSCLK_Frequency = LL_RCC_GetSystemClockFreq();

  /* HCLK clock frequency */
  RCC_Clocks->HCLK_Frequency   = RCC_GetHCLKClockFreq(RCC_Clocks->SYSCLK_Frequency);

