micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_ll_rcc.c
  /* PCLK1 clock frequency */
  RCC_Clocks->PCLK1_Frequency  = RCC_GetPCLK1ClockFreq(RCC_Clocks->HCLK_Frequency);

  /* PCLK2 clock frequency */
  RCC_Clocks->PCLK2_Frequency  = RCC_GetPCLK2ClockFreq(RCC_Clocks->HCLK_Frequency);

  /* PCLK4 clock frequency */
  RCC_Clocks->PCLK4_Frequency  = RCC_GetPCLK4ClockFreq(RCC_Clocks->HCLK_Frequency);

  /* PCLK5 clock frequency */
  RCC_Clocks->PCLK5_Frequency  = RCC_GetPCLK5ClockFreq(RCC_Clocks->HCLK_Frequency);
}

/**
  * @brief  Return CPU clock frequency
  * @retval CPU clock frequency (in Hz)
  */
uint32_t LL_RCC_GetCpuClockFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t ic_divider;

  /* Get CPU clock source ----------------------------------------------------*/
  switch (LL_RCC_GetCpuClkSource())
  {
    /* No check on Ready: Won't be selected by hardware if not */
    case LL_RCC_CPU_CLKSOURCE_STATUS_HSI:
      frequency = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_HSICFGR_HSIDIV_Pos);
      break;

    case LL_RCC_CPU_CLKSOURCE_STATUS_MSI:
      frequency = MSI_VALUE;
      break;

    case LL_RCC_CPU_CLKSOURCE_STATUS_HSE:
      frequency = HSE_VALUE;
      break;

    case LL_RCC_CPU_CLKSOURCE_STATUS_IC1:
      ic_divider = LL_RCC_IC1_GetDivider();
      switch (LL_RCC_IC1_GetSource())
      {
        case LL_RCC_ICCLKSOURCE_PLL1:
          frequency = LL_RCC_GetPLL1ClockFreq();
          frequency = frequency / ic_divider;
          break;
        case LL_RCC_ICCLKSOURCE_PLL2:
          frequency = LL_RCC_GetPLL2ClockFreq();
          frequency = frequency / ic_divider;
          break;
        case LL_RCC_ICCLKSOURCE_PLL3:
          frequency = LL_RCC_GetPLL3ClockFreq();
          frequency = frequency / ic_divider;
          break;
        case LL_RCC_ICCLKSOURCE_PLL4:
          frequency = LL_RCC_GetPLL4ClockFreq();
          frequency = frequency / ic_divider;
          break;
        default:
          /* Unexpected case */
          break;
      }
      break;

    default:
      /* Unexpected case */
      break;
  }

  return frequency;
}

/**
  * @brief  Return SYSTEM bus clock frequency
  * @retval SYSTEM bus clock frequency (in Hz)
  */
uint32_t LL_RCC_GetSystemClockFreq(void)
{
  uint32_t frequency = 0U;
  uint32_t ic_divider;

  /* Get SYSCLK source -------------------------------------------------------*/
  switch (LL_RCC_GetSysClkSource())
  {
    /* No check on Ready: Won't be selected by hardware if not */
    case LL_RCC_SYS_CLKSOURCE_STATUS_HSI:
      frequency = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_HSICFGR_HSIDIV_Pos);
      break;

    case LL_RCC_SYS_CLKSOURCE_STATUS_MSI:
      frequency = MSI_VALUE;
      break;

    case LL_RCC_SYS_CLKSOURCE_STATUS_HSE:
      frequency = HSE_VALUE;
      break;

    case LL_RCC_SYS_CLKSOURCE_STATUS_IC2_IC6_IC11:
      ic_divider = LL_RCC_IC2_GetDivider();
      switch (LL_RCC_IC2_GetSource())
      {
        case LL_RCC_ICCLKSOURCE_PLL1:
          frequency = LL_RCC_GetPLL1ClockFreq();
          frequency = frequency / ic_divider;
          break;
        case LL_RCC_ICCLKSOURCE_PLL2:
          frequency = LL_RCC_GetPLL2ClockFreq();
          frequency = frequency / ic_divider;
          break;
        case LL_RCC_ICCLKSOURCE_PLL3:
          frequency = LL_RCC_GetPLL3ClockFreq();
          frequency = frequency / ic_divider;
          break;
        case LL_RCC_ICCLKSOURCE_PLL4:
          frequency = LL_RCC_GetPLL4ClockFreq();
          frequency = frequency / ic_divider;
          break;
        default:
          /* Unexpected case */
          break;
      }
      break;

    default:
      /* Unexpected case */
      break;
  }

  return frequency;
}

/**
  * @brief  Return PLL1 clock frequency
  * @note   LL_RCC_PERIPH_FREQUENCY_NO returned for non activated output or oscillator not ready
  * @retval PLL1 output clock frequency
  */
uint32_t LL_RCC_GetPLL1ClockFreq(void)
{
  uint32_t pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t plloutputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t pllsource;
  uint32_t divm;

  /* PLL_VCO = (HSE_VALUE, MSI_VALUE or HSI_VALUE/HSIDIV) / PLLM * (PLLN + FRACN)
     SYSCLK = PLL_VCO / PLLP1 / PLLP2
  */
  if (LL_RCC_PLL1_IsReady() != 0U)
  {
    if (LL_RCC_PLL1P_IsEnabled() != 0U)
    {
      pllsource = LL_RCC_PLL1_GetSource();

      switch (pllsource)
      {
        case LL_RCC_PLLSOURCE_HSI:
          if (LL_RCC_HSI_IsReady() != 0U)
          {
            pllinputfreq = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_HSICFGR_HSIDIV_Pos);
          }
          break;

        case LL_RCC_PLLSOURCE_MSI:
          if (LL_RCC_MSI_IsReady() != 0U)
          {
            pllinputfreq = MSI_VALUE;
          }
          break;

        case LL_RCC_PLLSOURCE_HSE:
          if (LL_RCC_HSE_IsReady() != 0U)
          {
            pllinputfreq = HSE_VALUE;
          }
          break;

        case LL_RCC_PLLSOURCE_I2S_CKIN:
          pllinputfreq = EXTERNAL_CLOCK_VALUE;
          break;

        default:
          /* unexpected case */
          break;
      }

      if (pllinputfreq != LL_RCC_PERIPH_FREQUENCY_NO)
      {
        /* INTEGER mode only  - others TO DO */
        divm = LL_RCC_PLL1_GetM();

        if (divm != 0U)
        {
          plloutputfreq = LL_RCC_CalcPLLClockFreq(pllinputfreq, divm, LL_RCC_PLL1_GetN(), LL_RCC_PLL1_GetFRACN(), \
                                                  LL_RCC_PLL1_GetP1(), LL_RCC_PLL1_GetP2());
        }
      }
    }
  }

  return plloutputfreq;
}

/**
  * @brief  Return PLL2 clock frequency
  * @note   LL_RCC_PERIPH_FREQUENCY_NO returned for non activated output or oscillator not ready
  * @retval PLL2 output clock frequency
  */
uint32_t LL_RCC_GetPLL2ClockFreq(void)
{
  uint32_t pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t plloutputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t pllsource;
  uint32_t divm;

  /* PLL_VCO = (HSE_VALUE, MSI_VALUE or HSI_VALUE/HSIDIV) / PLLM * (PLLN + FRACN)
     SYSCLK = PLL_VCO / PLLP1 / PLLP2
  */
  if (LL_RCC_PLL2_IsReady() != 0U)
  {
    if (LL_RCC_PLL2P_IsEnabled() != 0U)
    {
      pllsource = LL_RCC_PLL2_GetSource();

