micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_ll_rcc.c
      switch (pllsource)
      {
        case LL_RCC_PLLSOURCE_HSI:
          if (LL_RCC_HSI_IsReady() != 0U)
          {
            pllinputfreq = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_HSICFGR_HSIDIV_Pos);
          }
          break;

        case LL_RCC_PLLSOURCE_MSI:
          if (LL_RCC_MSI_IsReady() != 0U)
          {
            pllinputfreq = MSI_VALUE;
          }
          break;

        case LL_RCC_PLLSOURCE_HSE:
          if (LL_RCC_HSE_IsReady() != 0U)
          {
            pllinputfreq = HSE_VALUE;
          }
          break;

        case LL_RCC_PLLSOURCE_I2S_CKIN:
          pllinputfreq = EXTERNAL_CLOCK_VALUE;
          break;

        default:
          /* unexpected case */
          break;
      }

      if (pllinputfreq != LL_RCC_PERIPH_FREQUENCY_NO)
      {
        /* INTEGER mode only  - others TO DO */
        divm = LL_RCC_PLL2_GetM();

        if (divm != 0U)
        {
          plloutputfreq = LL_RCC_CalcPLLClockFreq(pllinputfreq, divm, LL_RCC_PLL2_GetN(), LL_RCC_PLL2_GetFRACN(), \
                                                  LL_RCC_PLL2_GetP1(), LL_RCC_PLL2_GetP2());
        }
      }
    }
  }

  return plloutputfreq;
}

/**
  * @brief  Return PLL3 clock frequency
  * @note   LL_RCC_PERIPH_FREQUENCY_NO returned for non activated output or oscillator not ready
  * @retval PLL3 output clock frequency
  */
uint32_t LL_RCC_GetPLL3ClockFreq(void)
{
  uint32_t pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t plloutputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t pllsource;
  uint32_t divm;

  /* PLL_VCO = (HSE_VALUE, MSI_VALUE or HSI_VALUE/HSIDIV) / PLLM * (PLLN + FRACN)
     SYSCLK = PLL_VCO / PLLP1 / PLLP2
  */
  if (LL_RCC_PLL3_IsReady() != 0U)
  {
    if (LL_RCC_PLL3P_IsEnabled() != 0U)
    {
      pllsource = LL_RCC_PLL3_GetSource();

      switch (pllsource)
      {
        case LL_RCC_PLLSOURCE_HSI:
          if (LL_RCC_HSI_IsReady() != 0U)
          {
            pllinputfreq = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_HSICFGR_HSIDIV_Pos);
          }
          break;

        case LL_RCC_PLLSOURCE_MSI:
          if (LL_RCC_MSI_IsReady() != 0U)
          {
            pllinputfreq = MSI_VALUE;
          }
          break;

        case LL_RCC_PLLSOURCE_HSE:
          if (LL_RCC_HSE_IsReady() != 0U)
          {
            pllinputfreq = HSE_VALUE;
          }
          break;

        case LL_RCC_PLLSOURCE_I2S_CKIN:
          pllinputfreq = EXTERNAL_CLOCK_VALUE;
          break;

        default:
          /* unexpected case */
          break;
      }

      if (pllinputfreq != LL_RCC_PERIPH_FREQUENCY_NO)
      {
        /* INTEGER mode only  - others TO DO */
        divm = LL_RCC_PLL3_GetM();

        if (divm != 0U)
        {
          plloutputfreq = LL_RCC_CalcPLLClockFreq(pllinputfreq, divm, LL_RCC_PLL3_GetN(), LL_RCC_PLL3_GetFRACN(), \
                                                  LL_RCC_PLL3_GetP1(), LL_RCC_PLL3_GetP2());
        }
      }
    }
  }

  return plloutputfreq;
}

/**
  * @brief  Return PLL4 clock frequency
  * @note   LL_RCC_PERIPH_FREQUENCY_NO returned for non activated output or oscillator not ready
  * @retval PLL4 output clock frequency
  */
uint32_t LL_RCC_GetPLL4ClockFreq(void)
{
  uint32_t pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t plloutputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t pllsource;
  uint32_t divm;

  /* PLL_VCO = (HSE_VALUE, MSI_VALUE or HSI_VALUE/HSIDIV) / PLLM * (PLLN + FRACN)
     SYSCLK = PLL_VCO / PLLP1 / PLLP2
  */
  if (LL_RCC_PLL4_IsReady() != 0U)
  {
    if (LL_RCC_PLL4P_IsEnabled() != 0U)
    {
      pllsource = LL_RCC_PLL4_GetSource();

      switch (pllsource)
      {
        case LL_RCC_PLLSOURCE_HSI:
          if (LL_RCC_HSI_IsReady() != 0U)
          {
            pllinputfreq = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_HSICFGR_HSIDIV_Pos);
          }
          break;

        case LL_RCC_PLLSOURCE_MSI:
          if (LL_RCC_MSI_IsReady() != 0U)
          {
            pllinputfreq = MSI_VALUE;
          }
          break;

        case LL_RCC_PLLSOURCE_HSE:
          if (LL_RCC_HSE_IsReady() != 0U)
          {
            pllinputfreq = HSE_VALUE;
          }
          break;

        case LL_RCC_PLLSOURCE_I2S_CKIN:
          pllinputfreq = EXTERNAL_CLOCK_VALUE;
          break;

        default:
          /* unexpected case */
          break;
      }

      if (pllinputfreq != LL_RCC_PERIPH_FREQUENCY_NO)
      {
        /* INTEGER mode only  - others TO DO */
        divm = LL_RCC_PLL4_GetM();

        if (divm != 0U)
        {
          plloutputfreq = LL_RCC_CalcPLLClockFreq(pllinputfreq, divm, LL_RCC_PLL4_GetN(), LL_RCC_PLL4_GetFRACN(), \
                                                  LL_RCC_PLL4_GetP1(), LL_RCC_PLL4_GetP2());
        }
      }
    }
  }

  return plloutputfreq;
}

/**
  * @brief  Helper function to calculate the PLL frequency output when used in integer or fractional mode
  * @note ex: @ref LL_RCC_CalcPLLClockFreq (HSE_VALUE, @ref LL_RCC_PLL1_GetM (), @ref LL_RCC_PLL1_GetN (),
  *           @ref LL_RCC_PLL1_GetFRACN (), @ref LL_RCC_PLL1_GetP1 (), @ref LL_RCC_PLL1_GetP2 ());
  * @param  PLLInputFreq PLL Input frequency (based on HSE/(HSI/HSIDIV)/MSI)
  * @param  M      Between 1 and 63
  * @param  N      Between 16 and 640 in integer mode, 20 to 320 in fractional mode
  * @param  FRACN  0 in integer mode, between 0 and 0xFFFFFF in fractional mode
  * @param  P1     VCO output divider P1 between 1 and 7
  * @param  P2     VCO output divider P2 between 1 and 7
  * @retval PLL clock frequency (in Hz)
  */
uint32_t LL_RCC_CalcPLLClockFreq(uint32_t PLLInputFreq, uint32_t M, uint32_t N, uint32_t FRACN, uint32_t P1,
                                 uint32_t P2)
{
  float_t freq;

  freq = ((float_t)PLLInputFreq * ((float_t)N + ((float_t)FRACN / (float_t)0x1000000))) / (float_t)M;

  freq = freq / (float_t)P1;
  freq = freq / (float_t)P2;

  return (uint32_t)freq;
}

/**
  * @brief  Return ADC clock frequency
  * @param  ADCxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADC_CLKSOURCE
  * @retval ADC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetADCClockFreq(uint32_t ADCxSource)
{
  uint32_t frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  /* Check parameter */
  assert_param(IS_LL_RCC_ADC_CLKSOURCE(ADCxSource));

  switch (LL_RCC_GetADCClockSource(ADCxSource))
  {
    case LL_RCC_ADC_CLKSOURCE_HCLK:
      frequency = RCC_GetHCLKClockFreq(LL_RCC_GetSystemClockFreq());
      break;

