micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_ll_rcc.c
    case LL_RCC_LPUART1_CLKSOURCE_LSE:
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        frequency = LSE_VALUE;
      }
      break;

    default:
      /* Unexpected case */
      break;
  }

  return frequency;
}

/**
  * @brief  Return LTDC clock frequency
  * @param  LTDCxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LTDC_CLKSOURCE
  * @retval LTDC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetLTDCClockFreq(uint32_t LTDCxSource)
{
  uint32_t frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  /* Check parameter */
  assert_param(IS_LL_RCC_LTDC_CLKSOURCE(LTDCxSource));

  switch (LL_RCC_GetLTDCClockSource(LTDCxSource))
  {
    case LL_RCC_LTDC_CLKSOURCE_PCLK5:
      frequency = RCC_GetPCLK5ClockFreq(RCC_GetHCLKClockFreq(LL_RCC_GetSystemClockFreq()));
      break;

    case LL_RCC_LTDC_CLKSOURCE_CLKP:
      frequency = LL_RCC_GetCLKPClockFreq(LL_RCC_CLKP_CLKSOURCE);
      break;

    case LL_RCC_LTDC_CLKSOURCE_IC16:
      if (LL_RCC_IC16_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC16_GetDivider();
        switch (LL_RCC_IC16_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            frequency = LL_RCC_GetPLL1ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            frequency = LL_RCC_GetPLL2ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            frequency = LL_RCC_GetPLL3ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            frequency = LL_RCC_GetPLL4ClockFreq();
            frequency = frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    case LL_RCC_LTDC_CLKSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        frequency = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_HSICFGR_HSIDIV_Pos);
      }
      break;

    default:
      /* Unexpected case */
      break;
  }

  return frequency;
}

/**
  * @brief  Return MDFx clock frequency
  * @param  MDFxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MDF1_CLKSOURCE
  * @retval MDF clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetMDFClockFreq(uint32_t MDFxSource)
{
  uint32_t frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  /* Check parameter */
  assert_param(IS_LL_RCC_MDF_CLKSOURCE(MDFxSource));

  switch (LL_RCC_GetMDFClockSource(MDFxSource))
  {
    case LL_RCC_MDF1_CLKSOURCE_HCLK:
      frequency = RCC_GetHCLKClockFreq(LL_RCC_GetSystemClockFreq());
      break;

    case LL_RCC_MDF1_CLKSOURCE_CLKP:
      frequency = LL_RCC_GetCLKPClockFreq(LL_RCC_CLKP_CLKSOURCE);
      break;

    case LL_RCC_MDF1_CLKSOURCE_IC7:
      if (LL_RCC_IC7_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC7_GetDivider();
        switch (LL_RCC_IC7_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            frequency = LL_RCC_GetPLL1ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            frequency = LL_RCC_GetPLL2ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            frequency = LL_RCC_GetPLL3ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            frequency = LL_RCC_GetPLL4ClockFreq();
            frequency = frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    case LL_RCC_MDF1_CLKSOURCE_IC8:
      if (LL_RCC_IC8_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC8_GetDivider();
        switch (LL_RCC_IC8_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            frequency = LL_RCC_GetPLL1ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            frequency = LL_RCC_GetPLL2ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            frequency = LL_RCC_GetPLL3ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            frequency = LL_RCC_GetPLL4ClockFreq();
            frequency = frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    case LL_RCC_MDF1_CLKSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        frequency = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_HSICFGR_HSIDIV_Pos);
      }
      break;

    case LL_RCC_MDF1_CLKSOURCE_MSI:
      if (LL_RCC_MSI_IsReady() != 0U)
      {
        frequency = MSI_VALUE;
      }
      break;

    case LL_RCC_MDF1_CLKSOURCE_I2S_CKIN:
      frequency = EXTERNAL_CLOCK_VALUE;
      break;

    case LL_RCC_MDF1_CLKSOURCE_TIMG:
      frequency = LL_RCC_GetSystemClockFreq() / (1UL << LL_RCC_GetTIMPrescaler());
      break;

    default:
      /* Unexpected case */
      break;
  }

  return frequency;
}

/**
  * @brief  Return OTGPHYx clock frequency
  * @param  OTGPHYxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE
  * @retval OTGPHY clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetOTGPHYClockFreq(uint32_t OTGPHYxSource)
{
  uint32_t frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  /* Check parameter */
  assert_param(IS_LL_RCC_OTGPHY_CLKSOURCE(OTGPHYxSource));

  switch (LL_RCC_GetOTGPHYClockSource(OTGPHYxSource))
  {
    case LL_RCC_OTGPHY1_CLKSOURCE_CLKP:
    case LL_RCC_OTGPHY2_CLKSOURCE_CLKP:
      frequency = LL_RCC_GetCLKPClockFreq(LL_RCC_CLKP_CLKSOURCE);
      break;

    case LL_RCC_OTGPHY1_CLKSOURCE_IC15:
    case LL_RCC_OTGPHY2_CLKSOURCE_IC15:
      if (LL_RCC_IC15_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC15_GetDivider();
        switch (LL_RCC_IC15_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            frequency = LL_RCC_GetPLL1ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            frequency = LL_RCC_GetPLL2ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            frequency = LL_RCC_GetPLL3ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            frequency = LL_RCC_GetPLL4ClockFreq();
            frequency = frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    case LL_RCC_OTGPHY1_CLKSOURCE_HSE_DIV_2:
    case LL_RCC_OTGPHY2_CLKSOURCE_HSE_DIV_2:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        frequency = HSE_VALUE >> 1U;
      }
      break;

