micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_ll_rcc.c
    case LL_RCC_OTGPHY1_CLKSOURCE_HSE_DIV_2_OSC:
    case LL_RCC_OTGPHY2_CLKSOURCE_HSE_DIV_2_OSC:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        if (LL_RCC_HSE_IsSelectedHSEDiv2AsDiv2Clock() == 0UL)
        {
          frequency = HSE_VALUE;
        }
        else
        {
          frequency = HSE_VALUE >> 1U;
        }
      }
      break;

    default:
      /* Unexpected case */
      break;
  }

  return frequency;
}

/**
  * @brief  Return OTGPHYxCKREF clock frequency
  * @param  OTGPHYxCKREFSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_OTGPHY1CKREF_CLKSOURCE
  *         @arg @ref LL_RCC_OTGPHY2CKREF_CLKSOURCE
  * @retval OTGPHYCKREF clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetOTGPHYCKREFClockFreq(uint32_t OTGPHYxCKREFSource)
{
  uint32_t frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  /* Check parameter */
  assert_param(IS_LL_RCC_OTGPHYCKREF_CLKSOURCE(OTGPHYxCKREFSource));

  switch (LL_RCC_GetOTGPHYCKREFClockSource(OTGPHYxCKREFSource))
  {
    case LL_RCC_OTGPHY1CKREF_CLKSOURCE_OTGPHY1:
      frequency = LL_RCC_GetOTGPHYClockFreq(LL_RCC_OTGPHY1_CLKSOURCE);
      break;

    case LL_RCC_OTGPHY2CKREF_CLKSOURCE_OTGPHY2:
      frequency = LL_RCC_GetOTGPHYClockFreq(LL_RCC_OTGPHY2_CLKSOURCE);
      break;

    case LL_RCC_OTGPHY1CKREF_CLKSOURCE_HSE_DIV_2_OSC:
    case LL_RCC_OTGPHY2CKREF_CLKSOURCE_HSE_DIV_2_OSC:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        if (LL_RCC_HSE_IsSelectedHSEDiv2AsDiv2Clock() == 0UL)
        {
          frequency = HSE_VALUE;
        }
        else
        {
          frequency = HSE_VALUE >> 1U;
        }
      }
      break;

    default:
      /* Unexpected case */
      break;
  }

  return frequency;
}

/**
  * @brief  Return PSSI clock frequency
  * @param  PSSIxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PSSI_CLKSOURCE
  * @retval PSSI clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetPSSIClockFreq(uint32_t PSSIxSource)
{
  uint32_t frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  /* Check parameter */
  assert_param(IS_LL_RCC_PSSI_CLKSOURCE(PSSIxSource));

  switch (LL_RCC_GetPSSIClockSource(PSSIxSource))
  {
    case LL_RCC_PSSI_CLKSOURCE_HCLK:
      frequency = RCC_GetHCLKClockFreq(LL_RCC_GetSystemClockFreq());
      break;

    case LL_RCC_PSSI_CLKSOURCE_CLKP:
      frequency = LL_RCC_GetCLKPClockFreq(LL_RCC_CLKP_CLKSOURCE);
      break;

    case LL_RCC_PSSI_CLKSOURCE_IC20:
      if (LL_RCC_IC20_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC20_GetDivider();
        switch (LL_RCC_IC20_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            frequency = LL_RCC_GetPLL1ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            frequency = LL_RCC_GetPLL2ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            frequency = LL_RCC_GetPLL3ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            frequency = LL_RCC_GetPLL4ClockFreq();
            frequency = frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    case LL_RCC_PSSI_CLKSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        frequency = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_HSICFGR_HSIDIV_Pos);
      }
      break;

    default:
      /* Unexpected case */
      break;
  }

  return frequency;
}

/**
  * @brief  Return SAIx clock frequency
  * @param  SAIxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE
  * @retval SAI clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetSAIClockFreq(uint32_t SAIxSource)
{
  uint32_t frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  /* Check parameter */
  assert_param(IS_LL_RCC_SAI_CLKSOURCE(SAIxSource));

  switch (LL_RCC_GetSAIClockSource(SAIxSource))
  {
    case LL_RCC_SAI1_CLKSOURCE_PCLK2:
    case LL_RCC_SAI2_CLKSOURCE_PCLK2:
      frequency = RCC_GetPCLK2ClockFreq(RCC_GetHCLKClockFreq(LL_RCC_GetSystemClockFreq()));
      break;

    case LL_RCC_SAI1_CLKSOURCE_CLKP:
    case LL_RCC_SAI2_CLKSOURCE_CLKP:
      frequency = LL_RCC_GetCLKPClockFreq(LL_RCC_CLKP_CLKSOURCE);
      break;

    case LL_RCC_SAI1_CLKSOURCE_IC7:
    case LL_RCC_SAI2_CLKSOURCE_IC7:
      if (LL_RCC_IC7_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC7_GetDivider();
        switch (LL_RCC_IC7_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            frequency = LL_RCC_GetPLL1ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            frequency = LL_RCC_GetPLL2ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            frequency = LL_RCC_GetPLL3ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            frequency = LL_RCC_GetPLL4ClockFreq();
            frequency = frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    case LL_RCC_SAI1_CLKSOURCE_IC8:
    case LL_RCC_SAI2_CLKSOURCE_IC8:
      if (LL_RCC_IC8_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC8_GetDivider();
        switch (LL_RCC_IC8_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            frequency = LL_RCC_GetPLL1ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            frequency = LL_RCC_GetPLL2ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            frequency = LL_RCC_GetPLL3ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            frequency = LL_RCC_GetPLL4ClockFreq();
            frequency = frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

