micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_ll_rcc.c
    case LL_RCC_SAI1_CLKSOURCE_HSI:
    case LL_RCC_SAI2_CLKSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        frequency = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_HSICFGR_HSIDIV_Pos);
      }
      break;

    case LL_RCC_SAI1_CLKSOURCE_MSI:
    case LL_RCC_SAI2_CLKSOURCE_MSI:
      if (LL_RCC_MSI_IsReady() != 0U)
      {
        frequency = MSI_VALUE;
      }
      break;

    case LL_RCC_SAI1_CLKSOURCE_I2S_CKIN:
    case LL_RCC_SAI2_CLKSOURCE_I2S_CKIN:
      frequency = EXTERNAL_CLOCK_VALUE;
      break;

    case LL_RCC_SAI1_CLKSOURCE_SPDIFRX1:
    case LL_RCC_SAI2_CLKSOURCE_SPDIFRX1:
      frequency = LL_RCC_GetSPDIFRXClockFreq(LL_RCC_SPDIFRX1_CLKSOURCE);
      break;

    default:
      /* Unexpected case */
      break;
  }

  return frequency;
}

/**
  * @brief  Return SDMMC clock frequency
  * @param  SDMMCxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE
  * @retval SDMMC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetSDMMCClockFreq(uint32_t SDMMCxSource)
{
  uint32_t frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  /* Check parameter */
  assert_param(IS_LL_RCC_SDMMC_CLKSOURCE(SDMMCxSource));

  switch (LL_RCC_GetSDMMCClockSource(SDMMCxSource))
  {
    case LL_RCC_SDMMC1_CLKSOURCE_HCLK:
    case LL_RCC_SDMMC2_CLKSOURCE_HCLK:
      frequency = RCC_GetHCLKClockFreq(LL_RCC_GetSystemClockFreq());
      break;

    case LL_RCC_SDMMC1_CLKSOURCE_CLKP:
    case LL_RCC_SDMMC2_CLKSOURCE_CLKP:
      frequency = LL_RCC_GetCLKPClockFreq(LL_RCC_CLKP_CLKSOURCE);
      break;

    case LL_RCC_SDMMC1_CLKSOURCE_IC4:
    case LL_RCC_SDMMC2_CLKSOURCE_IC4:
      if (LL_RCC_IC4_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC4_GetDivider();
        switch (LL_RCC_IC4_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            frequency = LL_RCC_GetPLL1ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            frequency = LL_RCC_GetPLL2ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            frequency = LL_RCC_GetPLL3ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            frequency = LL_RCC_GetPLL4ClockFreq();
            frequency = frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    case LL_RCC_SDMMC1_CLKSOURCE_IC5:
    case LL_RCC_SDMMC2_CLKSOURCE_IC5:
      if (LL_RCC_IC5_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC5_GetDivider();
        switch (LL_RCC_IC5_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            frequency = LL_RCC_GetPLL1ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            frequency = LL_RCC_GetPLL2ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            frequency = LL_RCC_GetPLL3ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            frequency = LL_RCC_GetPLL4ClockFreq();
            frequency = frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    default:
      /* Unexpected case */
      break;
  }

  return frequency;
}

/**
  * @brief  Return SPDIFRX clock frequency
  * @param  SPDIFRXxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPDIFRX1_CLKSOURCE
  * @retval SPDIF clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetSPDIFRXClockFreq(uint32_t SPDIFRXxSource)
{
  uint32_t frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  /* Check parameter */
  assert_param(IS_LL_RCC_SPDIFRX_CLKSOURCE(SPDIFRXxSource));

  switch (LL_RCC_GetSPDIFRXClockSource(SPDIFRXxSource))
  {
    case LL_RCC_SPDIFRX1_CLKSOURCE_PCLK1:
      frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(LL_RCC_GetSystemClockFreq()));
      break;

    case LL_RCC_SPDIFRX1_CLKSOURCE_CLKP:
      frequency = LL_RCC_GetCLKPClockFreq(LL_RCC_CLKP_CLKSOURCE);
      break;

    case LL_RCC_SPDIFRX1_CLKSOURCE_IC7:
      if (LL_RCC_IC7_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC7_GetDivider();
        switch (LL_RCC_IC7_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            frequency = LL_RCC_GetPLL1ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            frequency = LL_RCC_GetPLL2ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            frequency = LL_RCC_GetPLL3ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            frequency = LL_RCC_GetPLL4ClockFreq();
            frequency = frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    case LL_RCC_SPDIFRX1_CLKSOURCE_IC8:
      if (LL_RCC_IC8_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC8_GetDivider();
        switch (LL_RCC_IC8_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            frequency = LL_RCC_GetPLL1ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            frequency = LL_RCC_GetPLL2ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            frequency = LL_RCC_GetPLL3ClockFreq();
            frequency = frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            frequency = LL_RCC_GetPLL4ClockFreq();
            frequency = frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

